app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'g', 'pg', 'pg-13', 'r')  ORDER BY "movies"."title" ASC
---
    <tr>
      <th class='<%= @title_css_class %>'><%= link_to 'Movie Title', movies_path(:filter => 'title', :ratings => @ratings_to_show.map{ |rating| [rating, 1]}.to_h) %></th>