app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.all_ratings
      @ratings_to_show = Movie.all_ratings
      logger.debug "params[:filter] is #{params[:filter]}"
      if params[:ratings] != nil
        temp = Movie.all_ratings
        @ratings_to_show.each do |rating|
          if not params[:ratings].key?(rating)
            temp.delete(rating)
          end
        end
        @ratings_to_show = temp
      end
      @movies = Movie.with_ratings(@ratings_to_show)

      @title_css_class = "hilite"
      @date_css_class = "hilite"
      if params[:filter] != nil
        if params[:filter] == "title"
          @movies = @movies.order(:title)
          @title_css_class = "hilite bg-warning"
        elsif params[:filter] == "date"
          @movies = @movies.order(:release_date)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'g', 'pg', 'pg-13', 'r')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'g', 'pg', 'pg-13', 'r')  ORDER BY "movies"."release_date" ASC